{
  "items": [
    {
      "dates": "January 2019",
      "qaulifaction": "AWS Technical Essentials & Developing on AWS",
      "school": "QA",
      "icon": "eduIcon"
    },
    {
      "dates": "January 2018",
      "qaulifaction": "Introduction to Cyber Security",
      "school": "Open University",
      "icon": "eduIcon"
    },
    {
      "dates": "July 2016 - Present",
      "job_title": "Software Engineer",
      "company": "BAE Systems Applied Intelligence, London",
      "bio": [
        "I have been involved in various client-side software engineering projects through my employment. I completed a bespoke training academy covering Object-Oriented design, Java Enterprise, Testing processes, and software lifecycles. Which resulted in multiple professional certifications including Oracle Certified Associate - Java SE 7 Programmer",
        "Project 1 - Part of a small customer facing development team developing a bespoke data preparation and cleansing tool to prepare the customers for a data migration. Built using VBA, SQL and PowerShell. The project included working with 3rd party suppliers to implement process and backend services and directly with the customer to deliver and train users on how to operate the tool. The tool helped to successfully migrate ~50-60TB of user data.",
        "Project 2 - Part of a small agile development team based on customer site. Developing and supporting an existing data analysis framework using Linux, Python, Elasticsearch, Kibana, Kafka, and open source tools and micro services. Co-Leading a small team of developers and interns using agile development to bring new features, performance improvements and fixes to a mission critical live environment."
      ],
      "responsiblities": [
        "Liaise with Clients and end users directly to gain feedback and requirements",
        "Working with agile methodologies to deliver iterative project updates",
        "Design, Develop, Test, and Deploy code to a high standard"

      ],
      "acheivements": [
        "Temporary running a project by myself and reporting to the product owner",
        "Develop technical skills to adapt to new technologies between projects",
        "Winning trust of a client and strengthening the company relationship",
        "Leading and mentoring Interns and junior staff"
      ],
      "icon": "WorkIcon"

    },
    {
      "dates": "January 2017",
      "qaulifaction": "ITIL® Foundation certificate",
      "school": "BCS",
      "icon": "eduIcon"
    },
    {
      "dates": "November 2016",
      "qaulifaction": "Oracle Certified Associate, Java SE 7 Programmer",
      "school": "Oracle",
      "icon": "eduIcon"
    },
    {
      "dates": "October 2016",
      "qaulifaction": "ISTQB-BCS Certiﬁed Tester Foundation Level",
      "school": "BCS",
      "icon": "eduIcon"
    },
    {
      "dates": "2013 - 2016",
      "qaulifaction": "Bachelor's Degree with Hons, Computer Science with Games Development",
      "school": "The University of Hull",
      "icon": "eduIcon"
    },
    {
      "dates": "August 2015 - May 2016 ",
      "job_title": "Junior IT Analyst",
      "company": "University of Hull, Hull",
      "bio": [
        "As a temporary help for the departments IT Systems team, tasks I had to perform included imaging lab pc's, installing new pc's, testing new OS after they have been deployed and providing low level technical support to staff and students. Working in the departments system team I can learn more about how a business' infrastructure is managed, supported and maintained."
      ],
      "responsiblities": [
        "Provide extra help for the IT team",
        "Deploy PC images for the start of term",
        "Provide Technical support to the lectures"

      ],
      "acheivements": [
        "Developing a good reputation with lectures and the IT team",
        "Understanding business infrastructure and deployment on a large scale"
      ],
      "icon": ""

    },
    {
      "dates": "March 2015 - August 2015",
      "job_title": "Software Engineer",
      "company": "University of Hull, Hull",
      "bio": [
        "As Part of a Collaboration with the University of Hull and Castle Hill Hospital, I have been Working with the Radiotherapy Physics Department to help develop a C# script to work on Eclipse (Varian Medical Systems) to create a tool to support research in radiotherapy. The Aim of the tool is to aid in the quality assurance process of the Plans"
      ],
      "responsiblities": [
        "Develop research software for an NHS department"

      ],
      "acheivements": [
        "Working with the NHS to develop/further understand the Varian system",
        "Provide a platform for the NHS team to further develop"
      ],
      "icon": ""

    },
    {
      "dates": "February 2014 - September 2014",
      "job_title": "HIVE Research Internship",
      "company": "University of Hull, Hull",
      "bio": [
        "I worked on a project within Hull Immersive Virtual Enviroment, which investigated using hand held devices to aid in Virtual Environments. Using a Wii remote, Unity, Virtual Reality Peripheral Network and a back projected 4-sided cube, I created a Star Wars based game in which the user used the Wii remote to controller the lightsaber."
      ],
      "responsiblities": [
        ">Research into my chosen project",
        "Develop a prototype application"
      ],
      "acheivements": [
        "Created a working prototype",
        "Understanding Virtual Reality technology"

      ],
      "icon": ""

    },
    {
      "dates": "July 2012 - September 2012",
      "job_title": "Security",
      "company": "G4S, London Olympics 2012",
      "bio": [
        "This was a full-time security position working on the Olympic Park for the London 2012 Olympic & Paralympic Games. During this time, I worked closely with the Armed Forces as part of the radiation team, scanning visitors as they entered the park for increased levels of radiation. I had to be alert and react quickly to any alerts. I also worked on the PSA sites bag searching and body searching visitors to the park. I also used the x-ray machine to pre-search bags."
      ],
      "responsiblities": [
        "First line of security for the Olympic park",
        "Proactive in maintain customers safety",
        "Provide help and assistance to customers"
      ],
      "acheivements": [
        "Developed skills outside of my comfort zone"
      ],
      "icon": ""

    }
  ]
}